//TODO
//===========================================================
// 해야할것
//===========================================================
// 몬스터 스킬 만들어야함 (유령 패시브스킬1)
// 전투 승리 시 유닛 경험치 얻는 연출 추가

//===========================================================
// 개선사항
//===========================================================
// 스킬데이터를 설명을 읽을때 [독] => [상태이상ID] 처럼 수정해서 ID값으로 상태이상 데이터를 불러올 수 있지 않을까?
// 전투 시 유닛의 UI 캔버스를 분리하지말고 통합해서 보여주도록 변경해야함(batch가 너무 올라감)
// 데이터베이스에 적합한 유형으로 유저데이터 수정해야함 (초 대규모 작업 주의)
// 전투 승리 팝업창의 WinResultUnitSlot 을 UnitSlot을 상속받도록 수정???

//===========================================================
// 버그 수정
//===========================================================
// 맵의 스테이지가 제대로 불러와지지 않는 버그?

//===========================================================
// QA
//===========================================================
// 전투 시 기본 선택 스킬이 자동으로 지정되어있어 액션 버튼만 클릭하면 되도록

