//TODO
//===========================================================
// 해야할것
//===========================================================
// 사운드 넣어줘야함
// 몬스터 스킬 만들어야함 (유령 패시브스킬1)
// 전투 승리 시 유닛 경험치 얻는 연출 추가

//===========================================================
// 개선사항
//===========================================================
// 전투 승리 팝업창의 WinResultUnitSlot 을 UnitSlot을 상속받도록 수정해야하나
// 데이터베이스에 적합한 유형으로 유저데이터 수정해야함 (초 대규모 작업 주의)

//===========================================================
// 버그 수정
//===========================================================
// 데미지 반사가 여러번 이루어지는 버그(스테이지 넘어갈때 상태이상이 제대로 종료 안되는 버그로 짐작됨)
// 맵의 스테이지가 제대로 불러와지지 않는 버그?
// 포메이션 팝업창 뜰때 batch 튀는 버그 수정해줘야함
// 유닛 합성 시 결과창 별 애니메이션이 완전히 끝나기전 창이 닫힐 경우 별애니메이션 중간에서 멈춰버리는 버그

//===========================================================
// QA
//===========================================================
// 전투 시 기본 선택 스킬이 자동으로 지정되어있어 액션 버튼만 클릭하면 되도록

