//TODO
//===========================================================
// 해야할것
//===========================================================
// 사운드 넣어줘야함
// 몬스터 스킬 만들어야함 (유령 패시브스킬1)
// 파이어베이스 붙여서 로그인 시스템 완성시키기
// 전투 승리 시 유닛 경험치 얻는 연출 추가

//===========================================================
// 개선사항
//===========================================================
// 전투 승리 팝업창의 WinResultUnitSlot 을 UnitSlot을 상속받도록 수정해야하나

//===========================================================
// 버그 수정
//===========================================================
// 포메이션 팝업창 뜰때 batch 튀는 버그 수정해줘야함
// 유닛 합성 시 결과창 별 애니메이션이 완전히 끝나기전 창이 닫힐 경우 별애니메이션 중간에서 멈춰버리는 버그

